Config/Documents/РаспискаИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспискаИнвентаризации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыОписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыФормОписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОписи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИнвентаризацииСРаспиской</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СоответствияДокументовИнвентаризационныхОписейИРасписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствияДокументовИнвентаризационныхОписейИРасписок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументРасписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспискаИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОписи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИнвентаризацииСРаспиской</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/РаспискаИнвентаризации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// Запрещаем даже обычную запись, если расписка заполнена некорректно.
	Если Не ЭтотОбъект.ПометкаУдаления И Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВсеЗаписиРаспискиИзРегистраСоответствияДокументов(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСоответствиеДокументаИнвентаризационнойОписиИРасписки();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКодФормыОписи(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьКодФормыОписи(ДанныеЗаполнения)
	
	ТаблицаНастроек = ИнвентаризацияСервер.ПолучитьТаблицуНастроекОписей61н();
	
	СтрокаТаблицыНастроек = ИнвентаризацияСервер.ПолучитьСтрокуТаблицыНастроекОписей61нПоОписи(ДанныеЗаполнения.ДокументОписи, ТаблицаНастроек);
	
	КодФормыОписи = СтрокаТаблицыНастроек.КодФормы;
	
КонецПроцедуры

Процедура ОбновитьСоответствиеДокументаИнвентаризационнойОписиИРасписки()
	
	ДокументРасписки = РегистрыСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок.НайтиДокументРасписки(ЭтотОбъект.ДокументОписи);
	
	СоздатьЗапись = Не ПометкаУдаления И Не ЗначениеЗаполнено(ДокументРасписки);
	
	УдалитьЗапись = ПометкаУдаления И ДокументРасписки = Ссылка;
	
	Если СоздатьЗапись Тогда
		НаборЗаписей = РегистрыСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОписи.Установить(ЭтотОбъект.ДокументОписи);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументОписи = ЭтотОбъект.ДокументОписи;
		НоваяЗапись.ДокументРасписки = ЭтотОбъект.Ссылка;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьИзДокументаРасписки", Истина);
		НаборЗаписей.Записать();
		
	ИначеЕсли УдалитьЗапись Тогда
		НаборЗаписей = РегистрыСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОписи.Установить(ЭтотОбъект.ДокументОписи);
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьИзДокументаРасписки", Истина);
		НаборЗаписей.Записать();
		
	Иначе
		Если Не ПометкаУдаления И ДокументРасписки <> Ссылка Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Справочно: к документу инвентаризационной описи уже оформлена другая %1'"), Строка(ДокументРасписки));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,, "Объект.ДокументОписи");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в транзакции удаления перед непосредственным удалением объекта из базы данных.
Процедура УдалитьВсеЗаписиРаспискиИзРегистраСоответствияДокументов(ДокументРасписки)
	
	СсылкаНаДокумент = ДокументРасписки.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствияДокументовИнвентаризационныхОписейИРасписок.ДокументОписи КАК ДокументОписи
	|ИЗ
	|	РегистрСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок КАК СоответствияДокументовИнвентаризационныхОписейИРасписок
	|ГДЕ
	|	СоответствияДокументовИнвентаризационныхОписейИРасписок.ДокументРасписки = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок.ПолноеИмя());
		ЭлементБлокировки.ИсточникДанных = ТаблицаЗаписей;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументОписи", "ДокументОписи");
		Блокировка.Заблокировать();
		
		Для Каждого СтрТЧ Из ТаблицаЗаписей Цикл
			НаборЗаписей = РегистрыСведений.СоответствияДокументовИнвентаризационныхОписейИРасписок.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОписи.Установить(СтрТЧ.ДокументОписи);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьИзДокументаРасписки", Истина);
			НаборЗаписей.Записать();
		КонецЦикла;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
